[{
    "type": "Claim",
    "notes": "1. An oversampled analog modulator, comprising:\r\na plurality of switched-capacitor integrators connected in series;\r\na plurality of pole-defining switched-capacitor feedback structures each associated with one of said switched-capacitor integrators and having one side thereof connected to the output of said associated switched-capacitor integrator;\r\na first summing junction connected to the other side of each of said plurality of pole-defining switched-capacitor feedback structures for summing the output thereof;\r\na quantization circuit for quantizing the output of said first summing junction to provide the digital output of the analog modulator;\r\na second summing junction for summing the output of said quantization circuit with an analog input signal to provide the input to the first of said switched-capacitor integrators;\r\nat least one primary switched-capacitor feedback structure for defining zeros in the passband of the analog modulator and connected between the output of one of said switched-capacitor integrators and the input of the preceding and adjacent one of said switched-capacitor integrators; and\r\nat least one leap-frog switched-capacitor feedback structure connected between the output of the one of said switched-capacitor integrators having the input thereof connected to the output of said at least one primary switched-capacitor feedback structure and the input of the preceding one of said switched-capacitor integrators.\r\n2. The analog modulator of claim 1, wherein said primary switched-capacitor feedback structure and said leap-frog feedback structure comprise:\r\na plurality of primary switched-capacitor feedback structures connected across sequential adjacent pairs of said switched-capacitor integrators, said primary switched-capacitor feedback structures each having a coefficient associated therewith, the coefficients of said primary switched-capacitor feedback structures defining the position of the zeroes in the passband of analog response of the analog modulator; and\r\na plurality of leap-frog switched-capacitor structures numbering one less than the number of said primary switched-capacitor feedback structures and each connected between adjacent pairs of said switched-capacitor integrator structures.\r\n3. The analog modulator of claim 2, wherein the passband response of the analog modulator is an equi-ripple passband response.\r\n4. The analog modulator of claim 1, wherein said quantization circuit comprises a comparator for generating an output having at least two logic states and a switched-capacitor digital-to-analog converter for converting the output of said comparator to an analog signal for input to said second summing junction.\r\n5. The analog modulator of claim 1, wherein the digital output of said quantization circuit comprises a multi-level quantization output.\r\n6. The analog modulator of claim 1, wherein said analog modulator comprises a seventh order analog modulator.\r\n7. The analog modulator of claim 1, wherein the analog modulator is of an odd order.\r\n8. An oversampled analog modulator, comprising:\r\na plurality of switched-capacitor integrators connected in series and having a number Z of said switched-capacitor integrators;\r\na quantized feedback structure connected between the output of each of said switched-capacitor integrators and the input of the analog modulator in a summation configuration; and\r\na leap-frog feedback filter structure having:\r\nat least one switched-capacitor feedback loop connected from the output of the Mth one of said switched-capacitor integrators to the input of the Nth one of said switched-capacitor integrators, the value of M less than or equal to the value of Z and the value of N less than the value of M, and M, N and Z being integers, and\r\nat least one switched-capacitor leap-frog filter loop connected between the output of the Ith one of said switched-capacitor integrators and the input of the Kth one of said switched-capacitor integrators, I and K being integers, with I less than M and greater than or equal to N, and K less than N.\r\n9. The analog modulator of claim 8, wherein said quantizing feedback structure comprises:\r\na plurality of pole-defining switched-capacitor feedback structures, each associated with one of said switched-capacitor integrators and having one side thereof connected to the output of said associated switched-capacitor integrators;\r\na first summing junction connected to the other side of each of said plurality of said pole-defining switched-capacitor feedback structures for summing the output thereof;\r\na quantization circuit for quantizing the output of said first summing junction to provide the digital output of the analog modulator;\r\na data conversion device for converting the digital output of said quantization circuit to an analog signal; and\r\na second summing junction for summing the output of said data conversion circuit with an analog input signal to provide the input to the first of said switched-capacitor integrators.\r\n10. The analog modulator of claim 9, wherein said quantization circuit comprises a comparator for generating an output having at least two logic states and a data conversion device comprising a switched-capacitor digital-to-analog converter for converting the output of said comparator to an analog signal for input to said second summing junction.\r\n11. The analog modulator of claim 12, wherein said primary switched-capacitor feedback structure and said leap-frog feedback structure comprise:\r\na plurality of primary switched-capacitor feedback structures connected across sequential adjacent pairs of said switched-capacitor integrators, said primary switched-capacitor feedback structures each having a coefficient associated therewith, the coefficients of said primary switched-capacitor feedback structures defining the position of the zeroes in the passband of the analog response of the analog modulator; and\r\na plurality of leap-frog switched-capacitor structures numbering one less than the number of said primary switched-capacitor feedback structures and each connected between adjacent pairs of said switched-capacitor integrator structures, the input of the one of said leap-frog feedback structures connected between the two of said switched-capacitor integrators associated with the highest order one of said primary feedback structures.\r\n12. The analog modulator of claim 8, wherein the value of N is equal to M-1.\r\n13. The analog modulator of claim 8, wherein the value of N is equal to the value of I.\r\n14. The analog modulator of claim 8, wherein the value of K is equal to N-1.\r\n15. A method for converting an analog input signal to a digital output signal, comprising the steps of:\r\nproviding a plurality of switched-capacitor integrators, there being Z switched-capacitor integrators, Z being an integer;\r\nconnecting the switched-capacitor integrators in a series configuration;\r\nfeeding back each of the outputs of the switched-capacitor integrators through a weighted coefficient to the input of the first of the switched-capacitor integrators in the series and summing the feedback signal with the analog input signal and the step of feeding back operable to quantize with the feedback signal through a quantization structure to provide the digital output signal, which digital output signal is then converted to an analog signal for summing with the analog input signal;\r\nfeeding back the output of the Mth one of the switched-capacitor integrators to the input of the Nth one of the switched-capacitor integrators through a primary feedback structure, N and M being integers with M less than or equal to the value of Z and N less than M; and\r\nfeeding back the output of the Ith one of the switched-capacitor integrators to the input of the Kth one of the switched-capacitor integrators through a leap-frog field feedback structure, I and K being integers with I less than M and greater than or equal to N, and K less than N.\r\n16. The method of claim 15, wherein the value of N is equal to M-1.\r\n17. The method of claim 15, wherein the value of M is equal to I.\r\n18. The method of claim 15, wherein the value of K is equal to M-1.",
    "language": "English"
}, {
    "type": "Rich Text",
    "notes": "<li><strong>If n is a natural number</strong>, a<sup>n</sup> – b<sup>n</sup> = (a – b)(a<sup>n-1</sup> + a<sup>n-2</sup>b+…+ b<sup>n-2</sup>a + b<sup>n-1</sup>)</li>"
}]